In [1]:
import os
os.chdir("c:\\data\\controllers")

In [2]:
import pandas as pd

available = pd.read_csv("data\\availability.csv",index_col=0)
shifts = pd.read_csv("data\\shift_setup.csv", index_col=0)

In [3]:
import os
os.getcwd()

'c:\\data\\controllers'

In [4]:
available.head()

                Date
Employee
Dipesh    2022-09-19
Sam       2022-09-21
Carly     2022-09-23

In [5]:
shifts.head()

,2022-09-21,2022-09-22,2022-09-23,2022-09-24,2022-09-25,2022-09-26,2022-09-27,2022-09-28
John,1,1,1,1,1,1,1,1
Ivy,1,1,1,1,1,1,1,1
Sam,1,1,1,1,1,1,1,1
Lucy,1,1,1,1,1,1,1,1
Rebecca,1,1,1,1,1,1,1,1

In [6]:
def test(df1,df2):
    for value in df1['Date'].values:
        for date in df2.columns:
            if value == date:

IndentationError: expected an indented block after 'if' statement on line 4 (756225042.py, line 5)